app/controllers/blogs_controller.rb

  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save
---
INSERT INTO "blogs" ("title", "body", "created_at", "updated_at", "slug") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "My something blog"], ["body", "yup\r\n"], ["created_at", 2017-04-26 00:45:27 UTC], ["updated_at", 2017-04-26 00:45:27 UTC], ["slug", "my-something-blog"]]

    def set_blog
      @blog = Blog.friendly.find(params[:id])
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]