app/controllers/portfolios_controller.rb

SELECT "portfolios".* FROM "portfolios"
---
  def index
    @portfolio_items = Portfolio.all

INSERT INTO "portfolios" ("title", "subtitle", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "My something"], ["subtitle", "asdf"], ["body", "asdfasf"], ["created_at", 2017-04-17 06:00:24 UTC], ["updated_at", 2017-04-17 06:00:24 UTC]]
---
    def create
    @portfolio_item = Portfolio.new(portfolio_params)

    respond_to do |format|
      if @portfolio_item.save

SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def edit
      @portfolio_item = Portfolio.find(params[:id])

SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
UPDATE "portfolios" SET "title" = $1, "updated_at" = $2 WHERE "portfolios"."id" = $3  [["title", "Portfolio title: 4123"], ["updated_at", 2017-04-17 06:23:16 UTC], ["id", 5]]
---
      def update
        @portfolio_item = Portfolio.find(params[:id])

        respond_to do |format|
        if @portfolio_item.update(portfolio_params)

SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def show
    @portfolio_item = Portfolio.find(params[:id])

SELECT  "portfolios".* FROM "portfolios" WHERE "portfolios"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "portfolios" WHERE "portfolios"."id" = $1  [["id", 1]]
---
  def destroy
    #This is going to perform the lookup
    @portfolio_item = Portfolio.find(params[:id])
    #This is going to Destroy
    @portfolio_item.destroy